<main>
	<section class="hero">
		<hgroup>
			<h1>Найди опытного наставника</h1>
			<p>и определи своё направление</p>
		</hgroup>
		<input
			type="button"
			value="Выбрать ментора"
			onclick={() => {
				window.location.href = '/mentors';
			}}
		/>

		<h2>О нас</h2>
		<p>
			MentorMatch - платформа, которая соединяет начинающих специалистов с опытными менторами для
			помощи новичкам найти своё направление, не допускать ошибок, и мы ↓
		</p>
	</section>

	<section class="features">
		<div class="feature-card">
			<h2>Поможем каждому</h2>
			<p>
				На нашем сайте вы найдёте помощь по любому вопросу: определиться, куда поступать, как лучше
				готовиться к экзаменам, как выбрать своё направление, как лучше искать работу, ведь мы
				гордимся своими специалистами.
			</p>
		</div>

		<div class="feature-card">
			<h2>Выберай ментора</h2>
			<p>
				Найди подходящего наставника в удобном списке менторов. Оставь заявку, после одобрения
				которой с тобой свяжется выбранный ментор.
			</p>
		</div>

		<div class="feature-card">
			<h2>Хотите помогать студентам и не только?</h2>
			<p>
				Вы можете <a href="/mentors/apply">подать заявку на становление ментором</a> и помогать нуждающимся
				в вашей помощи студентам. Всё, что понадобится, это зарегистрироваться на сервисе и заполнить
				небольшую форму.
			</p>
		</div>
	</section>
	<!--
	<section class="cta">
		<a href="/mentors" class="cta-btn">Найти ментора</a>
	</section> -->
</main>
